waveonly/wavemakerBased/IrregularWaves/I5_0deg/constant/wavemakerMovementDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      waveDict;
}
//---------------------------------------------------------------------------*//

wavemakerType   Flap;
nPaddles   1;
genAbs          1;
hingeHeight    -1.500000;

timeSeries 16501(
0.000000
0.100000
0.200000
0.300000
0.400000
0.500000
0.600000
0.700000
0.800000
0.900000
1.000000
1.100000
1.200000
1.300000
1.400000
1.500000
1.600000
1.700000
1.800000
1.900000
2.000000
2.100000
2.200000
2.300000
2.400000
2.500000
2.600000
2.700000
2.800000
2.900000
3.000000
3.100000
3.200000
3.300000
3.400000
3.500000
3.600000
3.700000
3.800000
3.900000
4.000000
4.100000
4.200000
4.300000
4.400000
4.500000
4.600000
4.700000
4.800000
4.900000
5.000000
5.100000
5.200000
5.300000
5.400000
5.500000
5.600000
5.700000
5.800000
5.900000
6.000000
6.100000
6.200000
6.300000
6.400000
6.500000
6.600000
6.700000
6.800000
6.900000
7.000000
7.100000
7.200000
7.300000
7.400000
7.500000
7.600000
7.700000
7.800000
7.900000
8.000000
8.100000
8.200000
8.300000
8.400000
8.500000
8.600000
8.700000
8.800000
8.900000
9.000000
9.100000
9.200000
9.300000
9.400000
9.500000
9.600000
9.700000
9.800000
9.900000
...
);

paddleTilt 1(
16501(
0.000000
0.002597
-0.016592
-0.061033
-0.100175
-0.091184
-0.036886
0.021095
0.066335
0.113455
0.153016
0.153177
0.119495
0.085714
0.038621
-0.071375
-0.225729
-0.320365
-0.285721
-0.162459
-0.029146
0.085540
0.187899
0.269334
0.302985
0.253871
0.112699
-0.071664
-0.205646
-0.224365
-0.154541
-0.060908
0.027804
0.091836
0.081638
-0.014328
-0.110276
-0.114937
-0.041416
0.049351
0.149087
0.245425
0.238396
0.056948
-0.183103
-0.289162
-0.238449
-0.163954
-0.114036
-0.003193
0.182769
0.313969
0.304204
0.219237
0.135617
0.028232
-0.135779
-0.312678
-0.447936
-0.507620
-0.407273
-0.064537
0.408330
0.718776
0.693684
0.434110
0.105306
-0.245940
-0.552620
-0.615850
-0.345321
0.018992
0.155432
0.064104
0.012443
0.125838
0.253196
0.240504
0.128940
0.027672
-0.049040
-0.142894
-0.251805
-0.323816
-0.287661
-0.084709
0.246843
0.523012
0.548001
0.311085
-0.025220
-0.316657
-0.516315
-0.581955
-0.448390
-0.136187
0.214896
0.468487
0.576716
...
);
