waveonly/wavemakerBased/IrregularWaves/I5_0deg/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    waveMaker
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }

    walls
    {
        type            empty;
        value           uniform 0;
    }
    bottom
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }
    outlet
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }

    atmosphere
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    floater
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
