waveonly/wavemakerBased/IrregularWaves/I5_0deg/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-100 -100 -100) (100.0 100.0 0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    /*boxToCell
    {
        box (-100 -100 -100) (1 100.0 5);
        fieldValues
        (
            volVectorFieldValue U     (0.269 0. 0.)
        );
    }*/
);


// ************************************************************************* //
